## Plan Result (prod-video-hearings)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;HMCTS - Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["HMCTS - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/HMCTS/providers/Microsoft.Authorization/roleAssignments/c7d5c2b8-bcc9-9b34-3057-8ece42ac954f" -> (known after apply)
      ~ name                             = "c7d5c2b8-bcc9-9b34-3057-8ece42ac954f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/d512d421-ed5c-ddd4-9c60-b616d0878160" -> "d512d421-ed5c-ddd4-9c60-b616d0878160" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"prod-video-hearings","Vars":{}} -->